uSolder/DualSlide/Software/firmware/embedded/board/dspcbr1/target/stm32h7a3/drivers/display_controller.c
    return NULL;
}

/* -------------------------------------------------------------------------- */
/* GPIO helpers                                                               */
/* -------------------------------------------------------------------------- */

static GPIO_TypeDef *DisplayController_GetGPIOPort(DisplayController_Pin pin)
{
    uint32_t port_index;

    if (pin == DISPLAY_CONTROLLER_PIN_UNUSED)
    {
        return NULL;
    }

    port_index = ((uint32_t)pin >> 4U) & 0x0FU;

    switch (port_index)
    {
        case 0U: return GPIOA;

        case 1U: return GPIOB;

        case 2U: return GPIOC;

        case 3U: return GPIOD;

        case 4U: return GPIOE;

        case 5U: return GPIOF;

        case 6U: return GPIOG;

        case 7U: return GPIOH;

        case 8U: return GPIOI;

        case 9U: return GPIOJ;

        case 10U: return GPIOK;

        default: return NULL;
    }
}

static uint32_t DisplayController_GetGPIOPinNumber(DisplayController_Pin pin)
{
    return (uint32_t)pin & 0x0FU;
}

/* -------------------------------------------------------------------------- */
/* Alternate-function mapping                                                 */
/* -------------------------------------------------------------------------- */

static DisplayController_Result DisplayController_GetAlternateFunction(DisplayController_Pin pin, uint32_t *alternate_function)
{
    if (alternate_function == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    switch (pin)
    {
        case PC0: case PC1: case PA5: case PA6: case PA7: case PC4: case PC5: case PB10: case PB14: case PB15: case PC6: case PC7: case PC10: case PC11: case PD2: case PB8: case PB9:
            *alternate_function = 14U;
            return DISPLAY_CONTROLLER_RESULT_OK;

        case PA8:
            *alternate_function = 13U;
            return DISPLAY_CONTROLLER_RESULT_OK;

        case PB5:
            *alternate_function = 11U;
            return DISPLAY_CONTROLLER_RESULT_OK;

        case PC9:
            *alternate_function = 10U;
            return DISPLAY_CONTROLLER_RESULT_OK;

        case PB0: case PB1:
            *alternate_function = 9U;
            return DISPLAY_CONTROLLER_RESULT_OK;

        default: return DISPLAY_CONTROLLER_RESULT_UNSUPPORTED;
    }
}

/* -------------------------------------------------------------------------- */
/* Validation                                                                 */
/* -------------------------------------------------------------------------- */

static DisplayController_Result DisplayController_ValidateRequiredPin(DisplayController_Pin pin)
{
    uint32_t alternate_function;

    if (pin == DISPLAY_CONTROLLER_PIN_UNUSED)
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    if (DisplayController_GetGPIOPort(pin) == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    return DisplayController_GetAlternateFunction(pin, &alternate_function);
}

static DisplayController_Result DisplayController_ValidateColorPins(const DisplayController_Pin pins[8])
{
    size_t index;
    uint32_t alternate_function;

    for (index = 0U; index < 8U; index++)
    {
        if (pins[index] == DISPLAY_CONTROLLER_PIN_UNUSED)
        {
            continue;
        }

        if (DisplayController_GetGPIOPort(pins[index]) == NULL)
        {
            return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
        }

        if (DisplayController_GetAlternateFunction(pins[index], &alternate_function) != DISPLAY_CONTROLLER_RESULT_OK)
        {
            return DISPLAY_CONTROLLER_RESULT_UNSUPPORTED;
        }
    }

    return DISPLAY_CONTROLLER_RESULT_OK;
}

static DisplayController_Result DisplayController_ValidatePins(const DisplayController_PinConfiguration *pins)
{
    DisplayController_Result result;

    if (pins == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    result = DisplayController_ValidateRequiredPin(pins->horizontal_sync_pin);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    result = DisplayController_ValidateRequiredPin(pins->vertical_sync_pin);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    result = DisplayController_ValidateRequiredPin(pins->data_enable_pin);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    result = DisplayController_ValidateRequiredPin(pins->pixel_clock_pin);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    result = DisplayController_ValidateColorPins(pins->red_pins);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    result = DisplayController_ValidateColorPins(pins->green_pins);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    return DisplayController_ValidateColorPins(pins->blue_pins);
}

static DisplayController_Result DisplayController_ValidateConfiguration(const DisplayController_Handle *controller)
{
    uint32_t requested_pixel_clock_hz;
    uint32_t actual_pixel_clock_hz;
    uint32_t difference_hz;
    uint32_t tolerance_hz;

    if (controller == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    if ((controller->timing.active_width == 0U) || (controller->timing.active_height == 0U))
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    if ((controller->timing.horizontal_sync_width == 0U) || (controller->timing.vertical_sync_height == 0U))
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    if (controller->timing.refresh_rate_millihz == 0U)
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    if ((controller->signals.horizontal_sync != DISPLAY_CONTROLLER_POLARITY_ACTIVE_LOW) && (controller->signals.horizontal_sync != DISPLAY_CONTROLLER_POLARITY_ACTIVE_HIGH))
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    if ((controller->signals.vertical_sync != DISPLAY_CONTROLLER_POLARITY_ACTIVE_LOW) && (controller->signals.vertical_sync != DISPLAY_CONTROLLER_POLARITY_ACTIVE_HIGH))
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    if ((controller->signals.data_enable != DISPLAY_CONTROLLER_POLARITY_ACTIVE_LOW) && (controller->signals.data_enable != DISPLAY_CONTROLLER_POLARITY_ACTIVE_HIGH))
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    if ((controller->signals.pixel_clock_edge != DISPLAY_CONTROLLER_PIXEL_CLOCK_RISING_EDGE) && (controller->signals.pixel_clock_edge != DISPLAY_CONTROLLER_PIXEL_CLOCK_FALLING_EDGE))
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

