uSolder/DualSlide/Software/firmware/embedded/board/dspcbr1/target/stm32h7a3/drivers/display_controller.c
    requested_pixel_clock_hz = DisplayController_CalculatePixelClock(&controller->timing);
    actual_pixel_clock_hz = RCC_GetKernelFrequency(LTDC);

    if ((requested_pixel_clock_hz == 0U) || (actual_pixel_clock_hz == 0U))
    {
        return DISPLAY_CONTROLLER_RESULT_IO_ERROR;
    }

    difference_hz = (requested_pixel_clock_hz > actual_pixel_clock_hz)
        ? requested_pixel_clock_hz - actual_pixel_clock_hz
        : actual_pixel_clock_hz - requested_pixel_clock_hz;

    tolerance_hz = (requested_pixel_clock_hz / 100U) * DISPLAY_CONTROLLER_PIXEL_CLOCK_TOLERANCE_PCT;

    if (difference_hz > tolerance_hz)
    {
        return DISPLAY_CONTROLLER_RESULT_UNSUPPORTED;
    }

    return DisplayController_ValidatePins(&controller->pins);
}

static DisplayController_Result DisplayController_ValidateLayer(const DisplayController_Handle *controller, const DisplayController_LayerConfiguration *layer)
{
    uint32_t bytes_per_pixel;
    size_t minimum_stride;

    if ((controller == NULL) || (layer == NULL) || (layer->framebuffer == NULL))
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    if ((layer->width == 0U) || (layer->height == 0U))
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    if ((layer->width != controller->timing.active_width) || (layer->height != controller->timing.active_height))
    {
        return DISPLAY_CONTROLLER_RESULT_UNSUPPORTED;
    }

    bytes_per_pixel = DisplayController_GetBytesPerPixel(layer->pixel_format);

    if (bytes_per_pixel == 0U)
    {
        return DISPLAY_CONTROLLER_RESULT_UNSUPPORTED;
    }

    minimum_stride = (size_t)layer->width * (size_t)bytes_per_pixel;

    if (layer->stride_bytes < minimum_stride)
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    return DISPLAY_CONTROLLER_RESULT_OK;
}

/* -------------------------------------------------------------------------- */
/* Pin configuration                                                          */
/* -------------------------------------------------------------------------- */

static DisplayController_Result DisplayController_ConfigurePin(DisplayController_Pin pin)
{
    GPIO_TypeDef *gpio;
    uint32_t pin_number;
    uint32_t alternate_function;
    uint32_t afr_index;
    uint32_t afr_position;
    DisplayController_Result result;

    if (pin == DISPLAY_CONTROLLER_PIN_UNUSED)
    {
        return DISPLAY_CONTROLLER_RESULT_OK;
    }

    gpio = DisplayController_GetGPIOPort(pin);

    if (gpio == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    result = DisplayController_GetAlternateFunction(pin, &alternate_function);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    if (RCC_EnablePeripheralClock(gpio) != RCC_RESULT_OK)
    {
        return DISPLAY_CONTROLLER_RESULT_IO_ERROR;
    }

    pin_number = DisplayController_GetGPIOPinNumber(pin);
    afr_index = pin_number / 8U;
    afr_position = (pin_number % 8U) * 4U;

    gpio->MODER &= ~(0x3UL << (pin_number * 2U));
    gpio->MODER |= DISPLAY_CONTROLLER_GPIO_MODE_ALTERNATE << (pin_number * 2U);

    gpio->OTYPER &= ~(1UL << pin_number);

    gpio->OSPEEDR &= ~(0x3UL << (pin_number * 2U));
    gpio->OSPEEDR |= DISPLAY_CONTROLLER_GPIO_SPEED_VERY_HIGH << (pin_number * 2U);

    gpio->PUPDR &= ~(0x3UL << (pin_number * 2U));

    gpio->AFR[afr_index] &= ~(0xFUL << afr_position);
    gpio->AFR[afr_index] |= alternate_function << afr_position;

    return DISPLAY_CONTROLLER_RESULT_OK;
}

static DisplayController_Result DisplayController_ConfigurePins(const DisplayController_PinConfiguration *pins)
{
    const DisplayController_Pin *color_groups[3];
    DisplayController_Result result;
    size_t group_index;
    size_t pin_index;

    result = DisplayController_ConfigurePin(pins->horizontal_sync_pin);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    result = DisplayController_ConfigurePin(pins->vertical_sync_pin);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    result = DisplayController_ConfigurePin(pins->data_enable_pin);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    result = DisplayController_ConfigurePin(pins->pixel_clock_pin);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    color_groups[0] = pins->red_pins;
    color_groups[1] = pins->green_pins;
    color_groups[2] = pins->blue_pins;

    for (group_index = 0U; group_index < 3U; group_index++)
    {
        for (pin_index = 0U; pin_index < 8U; pin_index++)
        {
            result = DisplayController_ConfigurePin(color_groups[group_index][pin_index]);

            if (result != DISPLAY_CONTROLLER_RESULT_OK)
            {
                return result;
            }
        }
    }

    return DISPLAY_CONTROLLER_RESULT_OK;
}

/* -------------------------------------------------------------------------- */
/* Timing and pixel-format helpers                                             */
/* -------------------------------------------------------------------------- */

static uint32_t DisplayController_CalculatePixelClock(const DisplayController_Timing *timing)
{
    uint64_t horizontal_total;
    uint64_t vertical_total;
    uint64_t pixel_clock_hz;

    if ((timing == NULL) || (timing->refresh_rate_millihz == 0U))
    {
        return 0U;
    }

    horizontal_total = (uint64_t)timing->horizontal_sync_width + (uint64_t)timing->horizontal_back_porch + (uint64_t)timing->active_width + (uint64_t)timing->horizontal_front_porch;

    vertical_total = (uint64_t)timing->vertical_sync_height + (uint64_t)timing->vertical_back_porch + (uint64_t)timing->active_height + (uint64_t)timing->vertical_front_porch;

    pixel_clock_hz = horizontal_total * vertical_total * (uint64_t)timing->refresh_rate_millihz / 1000ULL;

    if (pixel_clock_hz > UINT32_MAX)
    {
        return 0U;
    }

    return (uint32_t)pixel_clock_hz;
}

static uint32_t DisplayController_GetPixelFormatEncoding(DisplayController_PixelFormat pixel_format)
{
    switch (pixel_format)
    {
        case DISPLAY_CONTROLLER_PIXEL_FORMAT_ARGB8888: return 0U;

        case DISPLAY_CONTROLLER_PIXEL_FORMAT_RGB888: return 1U;

