uSolder/DualSlide/Software/firmware/embedded/board/dspcbr1/target/stm32h7a3/drivers/display_controller.c
        case DISPLAY_CONTROLLER_PIXEL_FORMAT_RGB565: return 2U;

        case DISPLAY_CONTROLLER_PIXEL_FORMAT_INDEXED_8_BIT: return 5U;

        default: return UINT32_MAX;
    }
}

static uint32_t DisplayController_GetBytesPerPixel(DisplayController_PixelFormat pixel_format)
{
    switch (pixel_format)
    {
        case DISPLAY_CONTROLLER_PIXEL_FORMAT_ARGB8888: return 4U;

        case DISPLAY_CONTROLLER_PIXEL_FORMAT_RGB888: return 3U;

        case DISPLAY_CONTROLLER_PIXEL_FORMAT_RGB565: return 2U;

        case DISPLAY_CONTROLLER_PIXEL_FORMAT_INDEXED_8_BIT: return 1U;

        default: return 0U;
    }
}

/* -------------------------------------------------------------------------- */
/* Register configuration                                                     */
/* -------------------------------------------------------------------------- */

static DisplayController_Result DisplayController_ConfigureGlobalRegisters(const DisplayController_Handle *controller)
{
    uint32_t horizontal_sync_width;
    uint32_t accumulated_horizontal_back_porch;
    uint32_t accumulated_active_width;
    uint32_t total_width;
    uint32_t vertical_sync_height;
    uint32_t accumulated_vertical_back_porch;
    uint32_t accumulated_active_height;
    uint32_t total_height;
    uint32_t global_control;

    horizontal_sync_width = (uint32_t)controller->timing.horizontal_sync_width - 1U;
    accumulated_horizontal_back_porch = (uint32_t)controller->timing.horizontal_sync_width + (uint32_t)controller->timing.horizontal_back_porch - 1U;
    accumulated_active_width = (uint32_t)controller->timing.horizontal_sync_width + (uint32_t)controller->timing.horizontal_back_porch + (uint32_t)controller->timing.active_width - 1U;
    total_width = (uint32_t)controller->timing.horizontal_sync_width + (uint32_t)controller->timing.horizontal_back_porch + (uint32_t)controller->timing.active_width + (uint32_t)controller->timing.horizontal_front_porch - 1U;

    vertical_sync_height = (uint32_t)controller->timing.vertical_sync_height - 1U;
    accumulated_vertical_back_porch = (uint32_t)controller->timing.vertical_sync_height + (uint32_t)controller->timing.vertical_back_porch - 1U;
    accumulated_active_height = (uint32_t)controller->timing.vertical_sync_height + (uint32_t)controller->timing.vertical_back_porch + (uint32_t)controller->timing.active_height - 1U;
    total_height = (uint32_t)controller->timing.vertical_sync_height + (uint32_t)controller->timing.vertical_back_porch + (uint32_t)controller->timing.active_height + (uint32_t)controller->timing.vertical_front_porch - 1U;

    if ((horizontal_sync_width > 0x0FFFU) || (accumulated_horizontal_back_porch > 0x0FFFU) || (accumulated_active_width > 0x0FFFU) || (total_width > 0x0FFFU) || (vertical_sync_height > 0x07FFU) || (accumulated_vertical_back_porch > 0x07FFU) || (accumulated_active_height > 0x07FFU) || (total_height > 0x07FFU))
    {
        return DISPLAY_CONTROLLER_RESULT_UNSUPPORTED;
    }

    LTDC->SSCR = (horizontal_sync_width << LTDC_SSCR_HSW_Pos) | (vertical_sync_height << LTDC_SSCR_VSH_Pos);
    LTDC->BPCR = (accumulated_horizontal_back_porch << LTDC_BPCR_AHBP_Pos) | (accumulated_vertical_back_porch << LTDC_BPCR_AVBP_Pos);
    LTDC->AWCR = (accumulated_active_width << LTDC_AWCR_AAW_Pos) | (accumulated_active_height << LTDC_AWCR_AAH_Pos);
    LTDC->TWCR = (total_width << LTDC_TWCR_TOTALW_Pos) | (total_height << LTDC_TWCR_TOTALH_Pos);

    global_control = 0U;

    if (controller->signals.horizontal_sync == DISPLAY_CONTROLLER_POLARITY_ACTIVE_HIGH)
    {
        global_control |= LTDC_GCR_HSPOL;
    }

    if (controller->signals.vertical_sync == DISPLAY_CONTROLLER_POLARITY_ACTIVE_HIGH)
    {
        global_control |= LTDC_GCR_VSPOL;
    }

    if (controller->signals.data_enable == DISPLAY_CONTROLLER_POLARITY_ACTIVE_HIGH)
    {
        global_control |= LTDC_GCR_DEPOL;
    }

    if (controller->signals.pixel_clock_edge == DISPLAY_CONTROLLER_PIXEL_CLOCK_FALLING_EDGE)
    {
        global_control |= LTDC_GCR_PCPOL;
    }

    LTDC->GCR = global_control;

    LTDC->BCCR = ((uint32_t)controller->background_color.red << LTDC_BCCR_BCRED_Pos) | ((uint32_t)controller->background_color.green << LTDC_BCCR_BCGREEN_Pos) | ((uint32_t)controller->background_color.blue << LTDC_BCCR_BCBLUE_Pos);

    return DISPLAY_CONTROLLER_RESULT_OK;
}

static DisplayController_Result DisplayController_ConfigureLayerRegisters(const DisplayController_Handle *controller, const DisplayController_LayerConfiguration *layer)
{
    uint32_t pixel_format;
    uint32_t window_start_x;
    uint32_t window_stop_x;
    uint32_t window_start_y;
    uint32_t window_stop_y;
    uint32_t line_length_bytes;
    uint32_t line_pitch_bytes;

    pixel_format = DisplayController_GetPixelFormatEncoding(layer->pixel_format);

    if (pixel_format == UINT32_MAX)
    {
        return DISPLAY_CONTROLLER_RESULT_UNSUPPORTED;
    }

    window_start_x = (uint32_t)controller->timing.horizontal_sync_width + (uint32_t)controller->timing.horizontal_back_porch;
    window_stop_x = window_start_x + (uint32_t)layer->width - 1U;

    window_start_y = (uint32_t)controller->timing.vertical_sync_height + (uint32_t)controller->timing.vertical_back_porch;
    window_stop_y = window_start_y + (uint32_t)layer->height - 1U;

    line_length_bytes = (uint32_t)layer->width * DisplayController_GetBytesPerPixel(layer->pixel_format);
    line_pitch_bytes = (uint32_t)layer->stride_bytes;

    if ((line_length_bytes > 0x1FFCU) || (line_pitch_bytes > 0x1FFFU))
    {
        return DISPLAY_CONTROLLER_RESULT_UNSUPPORTED;
    }

    LTDC_Layer1->CR = 0U;

    LTDC_Layer1->WHPCR = ((window_stop_x & 0x0FFFU) << LTDC_LxWHPCR_WHSPPOS_Pos) | ((window_start_x & 0x0FFFU) << LTDC_LxWHPCR_WHSTPOS_Pos);

    LTDC_Layer1->WVPCR = ((window_stop_y & 0x07FFU) << LTDC_LxWVPCR_WVSPPOS_Pos) | ((window_start_y & 0x07FFU) << LTDC_LxWVPCR_WVSTPOS_Pos);

    LTDC_Layer1->PFCR = pixel_format;
    LTDC_Layer1->CACR = 0xFFU;
    LTDC_Layer1->DCCR = 0U;

    LTDC_Layer1->BFCR = (DISPLAY_CONTROLLER_BLEND_FACTOR_1_CA << LTDC_LxBFCR_BF1_Pos) | (DISPLAY_CONTROLLER_BLEND_FACTOR_2_CA << LTDC_LxBFCR_BF2_Pos);

    LTDC_Layer1->CFBAR = (uint32_t)(uintptr_t)layer->framebuffer;

    LTDC_Layer1->CFBLR = (((line_length_bytes + 3U) & 0x1FFFU) << LTDC_LxCFBLR_CFBLL_Pos) | ((line_pitch_bytes & 0x1FFFU) << LTDC_LxCFBLR_CFBP_Pos);

