uSolder/DualSlide/Software/firmware/embedded/board/dspcbr1/target/stm32h7a3/drivers/display_controller.c
    LTDC_Layer1->CFBLNR = (uint32_t)layer->height;

    if (layer->pixel_format == DISPLAY_CONTROLLER_PIXEL_FORMAT_INDEXED_8_BIT)
    {
        LTDC_Layer1->CR |= LTDC_LxCR_CLUTEN;
    }

    return DISPLAY_CONTROLLER_RESULT_OK;
}

static DisplayController_Result DisplayController_ReloadImmediate(void)
{
    LTDC->SRCR = LTDC_SRCR_IMR;

    return DISPLAY_CONTROLLER_RESULT_OK;
}

static DisplayController_Result DisplayController_ReloadVerticalBlanking( DisplayController_State *state)
{
    if(state == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    state->reload_pending = true;
    state->reload_complete = false;

    LTDC->SRCR = LTDC_SRCR_VBR;

    return DISPLAY_CONTROLLER_RESULT_OK;
}

/**
 * @brief Configure the LTDC line and reload interrupts.
 *
 * The line interrupt is placed on the first line following the active image,
 * which is the beginning of the vertical-front-porch blanking interval.
 */
static void DisplayController_ConfigureInterrupts( const DisplayController_Handle *controller)
{
    uint32_t first_vertical_blank_line;

    first_vertical_blank_line = (uint32_t)controller->timing.vertical_sync_height + (uint32_t)controller->timing.vertical_back_porch + (uint32_t)controller->timing.active_height;

    LTDC->LIPCR = first_vertical_blank_line;
    LTDC->ICR = LTDC_ICR_CLIF | LTDC_ICR_CRRIF;
    LTDC->IER |= LTDC_IER_LIE | LTDC_IER_RRIE;

    NVIC_ClearPendingIRQ(LTDC_IRQn);
    NVIC_SetPriority(LTDC_IRQn, DISPLAY_CONTROLLER_INTERRUPT_PRIORITY);
    NVIC_EnableIRQ(LTDC_IRQn);
}

/**
 * @brief Disable LTDC frame-related interrupts.
 */
static void DisplayController_DisableInterrupts(void)
{
    NVIC_DisableIRQ(LTDC_IRQn);
    NVIC_ClearPendingIRQ(LTDC_IRQn);

    LTDC->IER &= ~(LTDC_IER_LIE | LTDC_IER_RRIE);
    LTDC->ICR = LTDC_ICR_CLIF | LTDC_ICR_CRRIF;
}

/* -------------------------------------------------------------------------- */
/* Public functions                                                           */
/* -------------------------------------------------------------------------- */

DisplayController_Result DisplayController_Init(DisplayController_Handle *controller)
{
    DisplayController_State *state;
    DisplayController_Result result;

    result = DisplayController_ValidateConfiguration(controller);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    if (DisplayController_FindState(controller) != NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_OK;
    }

    state = DisplayController_AllocateState(controller);

    if (state == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_BUSY;
    }

    if (RCC_EnablePeripheralClock(LTDC) != RCC_RESULT_OK)
    {
        return DISPLAY_CONTROLLER_RESULT_IO_ERROR;
    }

    if (RCC_ResetPeripheral(LTDC) != RCC_RESULT_OK)
    {
        return DISPLAY_CONTROLLER_RESULT_IO_ERROR;
    }

    result = DisplayController_ConfigurePins(&controller->pins);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    result = DisplayController_ConfigureGlobalRegisters(controller);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    LTDC_Layer1->CR &= ~LTDC_LxCR_LEN;
    LTDC->GCR &= ~LTDC_GCR_LTDCEN;

    result = DisplayController_ReloadImmediate();

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    state->vertical_blank_count = 0U;
    state->reload_pending = false;
    state->reload_complete = false;
    state->initialized = true;
    state->layer_configured = false;
    state->enabled = false;

    return DISPLAY_CONTROLLER_RESULT_OK;
}

DisplayController_Result DisplayController_ConfigureLayer(DisplayController_Handle *controller, const DisplayController_LayerConfiguration *layer)
{
    DisplayController_State *state;
    DisplayController_Result result;

    if ((controller == NULL) || (layer == NULL))
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    state = DisplayController_FindState(controller);

    if (state == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_NOT_INITIALIZED;
    }

    if (state->enabled)
    {
        return DISPLAY_CONTROLLER_RESULT_BUSY;
    }

    result = DisplayController_ValidateLayer(controller, layer);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    result = DisplayController_ConfigureLayerRegisters(controller, layer);

    if (result != DISPLAY_CONTROLLER_RESULT_OK)
    {
        return result;
    }

    state->layer = *layer;
    state->layer_configured = true;

    return DisplayController_ReloadImmediate();
}

DisplayController_Result DisplayController_SetFramebuffer(DisplayController_Handle *controller, void *framebuffer)
{
    DisplayController_State *state;

    if ((controller == NULL) || (framebuffer == NULL))
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    state = DisplayController_FindState(controller);

    if (state == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_NOT_INITIALIZED;
    }

    if (!state->layer_configured)
    {
        return DISPLAY_CONTROLLER_RESULT_NOT_INITIALIZED;
    }

    state->layer.framebuffer = framebuffer;
    LTDC_Layer1->CFBAR = (uint32_t)(uintptr_t)framebuffer;

    if (state->enabled)
    {
        return DisplayController_ReloadVerticalBlanking(state);
    }

    return DisplayController_ReloadImmediate();
}

DisplayController_Result DisplayController_SetPalette(DisplayController_Handle *controller, const uint32_t *palette, size_t count)
{
    DisplayController_State *state;
    size_t index;
    uint32_t color;

    if ((controller == NULL) || (palette == NULL) || (count == 0U) || (count > DISPLAY_CONTROLLER_MAX_PALETTE_ENTRIES))
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    state = DisplayController_FindState(controller);

    if (state == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_NOT_INITIALIZED;
    }

    if (!state->layer_configured)
    {
        return DISPLAY_CONTROLLER_RESULT_NOT_INITIALIZED;
    }

    if (state->layer.pixel_format != DISPLAY_CONTROLLER_PIXEL_FORMAT_INDEXED_8_BIT)
    {
        return DISPLAY_CONTROLLER_RESULT_UNSUPPORTED;
    }

    LTDC_Layer1->CR &= ~LTDC_LxCR_CLUTEN;

