uSolder/DualSlide/Software/firmware/embedded/board/dspcbr1/target/stm32h7a3/drivers/display_controller.c
    for (index = 0U; index < count; index++)
    {
        color = palette[index] & 0x00FFFFFFUL;

        LTDC_Layer1->CLUTWR = ((uint32_t)index << DISPLAY_CONTROLLER_CLUT_INDEX_POSITION) | (((color >> 16U) & 0xFFU) << DISPLAY_CONTROLLER_CLUT_RED_POSITION) | (((color >> 8U) & 0xFFU) << DISPLAY_CONTROLLER_CLUT_GREEN_POSITION) | (((color >> 0U) & 0xFFU) << DISPLAY_CONTROLLER_CLUT_BLUE_POSITION);
    }

    LTDC_Layer1->CR |= LTDC_LxCR_CLUTEN;

    if (state->enabled)
    {
        return DisplayController_ReloadVerticalBlanking(state);
    }

    return DisplayController_ReloadImmediate();
}

DisplayController_Result DisplayController_Enable(DisplayController_Handle *controller)
{
    DisplayController_State *state;

    if (controller == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    state = DisplayController_FindState(controller);

    if (state == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_NOT_INITIALIZED;
    }

    if (state->enabled)
    {
        return DISPLAY_CONTROLLER_RESULT_OK;
    }

    if (!state->layer_configured)
    {
        return DISPLAY_CONTROLLER_RESULT_NOT_INITIALIZED;
    }

    state->vertical_blank_count = 0U;
    state->reload_pending = false;
    state->reload_complete = false;

    DisplayController_ConfigureInterrupts(controller);

    LTDC_Layer1->CR |= LTDC_LxCR_LEN;
    LTDC->GCR |= LTDC_GCR_LTDCEN;

    state->enabled = true;

    return DisplayController_ReloadImmediate();
}

DisplayController_Result DisplayController_Disable(DisplayController_Handle *controller)
{
    DisplayController_State *state;

    if (controller == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_INVALID_ARGUMENT;
    }

    state = DisplayController_FindState(controller);

    if (state == NULL)
    {
        return DISPLAY_CONTROLLER_RESULT_NOT_INITIALIZED;
    }

    if (!state->enabled)
    {
        return DISPLAY_CONTROLLER_RESULT_OK;
    }

    DisplayController_DisableInterrupts();

    LTDC_Layer1->CR &= ~LTDC_LxCR_LEN;
    LTDC->GCR &= ~LTDC_GCR_LTDCEN;

    state->reload_pending = false;
    state->reload_complete = false;
    state->enabled = false;

    return DisplayController_ReloadImmediate();
}

uint32_t DisplayController_GetVerticalBlankCount( const DisplayController_Handle *controller)
{
    const DisplayController_State *state = DisplayController_FindState(controller);

    if(state == NULL)
    {
        return 0U;
    }

    return state->vertical_blank_count;
}

bool DisplayController_IsReloadPending( const DisplayController_Handle *controller)
{
    const DisplayController_State *state = DisplayController_FindState(controller);

    if(state == NULL)
    {
        return false;
    }

    return state->reload_pending;
}

bool DisplayController_ConsumeReloadComplete( DisplayController_Handle *controller)
{
    DisplayController_State *state = DisplayController_FindState(controller);
    bool reload_complete;

    if(state == NULL)
    {
        return false;
    }

    reload_complete = state->reload_complete;
    state->reload_complete = false;

    return reload_complete;
}

/**
 * @brief Handle LTDC line and shadow-register reload interrupts.
 *
 * This function is called by LTDC_IRQHandler() in the target interrupt-vector
 * file. It intentionally contains all LTDC interrupt-register handling so the
 * vector file remains a thin forwarding layer.
 */
void DisplayController_IRQHandler(void)
{
    uint32_t interrupt_status;
    size_t index;

    interrupt_status = LTDC->ISR;

    if((interrupt_status & LTDC_ISR_LIF) != 0U)
    {
        LTDC->ICR = LTDC_ICR_CLIF;

        for(index = 0U; index < DISPLAY_CONTROLLER_REGISTRY_SIZE; index++)
        {
            DisplayController_State *state = &DisplayController_Registry[index];

            if(state->initialized && state->enabled)
            {
                state->vertical_blank_count++;
            }
        }
    }

    if((interrupt_status & LTDC_ISR_RRIF) != 0U)
    {
        LTDC->ICR = LTDC_ICR_CRRIF;

        for(index = 0U; index < DISPLAY_CONTROLLER_REGISTRY_SIZE; index++)
        {
            DisplayController_State *state = &DisplayController_Registry[index];

            if(state->initialized && state->enabled)
            {
                state->reload_pending = false;
                state->reload_complete = true;
            }
        }
    }
}

void DisplayController_WaitForEvent(DisplayController_Handle *Controller)
{
    (void)Controller;
    __WFI();
}